Config/InformationRegisters/ИсторияОбменаЕСМВСМЭВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаЕСМВСМЭВ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеЗапрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОтвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиДанныхВМСД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторИсходногоЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СодержанияСообщенийЕСМВСМЭВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПакетыДанныхДляМСД</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСведений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСведенийЕСМВСМЭВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПередачиЕСМВСМЭВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ДействияПередачиЕСМВСМЭВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияПередачиЕСМВСМЭВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/CommonForms/АвтоматическийОбменКлиентМСД/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		ОтразитьСтатус(НСтр("ru='Не активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка())); 
		Элементы.Статус.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.Статус.Подсказка = НСтр("ru='Обмен с МСД ПУиО ГИИС ЭБ недоступен в веб-клиенте.'", 
		ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	#Иначе
		ЗапуститьАвтообмен = ПолучитьСведенияОТекущемРабочемМесте(ИмяКомпьютера());
		Если ЗапуститьАвтообмен Тогда 
			ПодключитьОбработчикОжидания("ОтправкаПолучениеСообщенийЕСМВ", 300); 
			ОтразитьСтатус(НСтр("ru='Активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
			ОтправкаПолучениеСообщенийЕСМВ();
		Иначе
			ОтразитьСтатус(НСтр("ru='Не активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка())); 
			Элементы.Статус.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
			Элементы.Статус.Подсказка = НСтр("ru='Обмен не активен т.к. текущий пользователь или компьютер не соответствует выбранным настройкам обмена с МСД ПУиО ГИИС ЭБ.'", 
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		КонецЕсли;		
	#КонецЕсли
КонецПроцедуры  	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДекорацияИсторияОбменаНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.ИсторияОбменаЕСМВСМЭВ.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОтправленоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачала", ДатаСтатуса);
	ПараметрыФормы.Вставить("ДействиеПередачи", ПредопределенноеЗначение("Перечисление.ДействияПередачиЕСМВСМЭВ.Отправка"));
	ОткрытьФорму("РегистрСведений.ИсторияОбменаЕСМВСМЭВ.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПолученоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачала", ДатаСтатуса);
	ПараметрыФормы.Вставить("ДействиеПередачи", ПредопределенноеЗначение("Перечисление.ДействияПередачиЕСМВСМЭВ.Получение"));
	ОткрытьФорму("РегистрСведений.ИсторияОбменаЕСМВСМЭВ.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьОбмен(Команда)
	#Если ВебКлиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Обмен с МСД ПУиО ГИИС ЭБ недоступен в веб-клиенте.'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		Возврат;
	#Иначе
		ЗапуститьАвтообмен = ПолучитьСведенияОТекущемРабочемМесте(ИмяКомпьютера());
		Если ЗапуститьАвтообмен Тогда 
			ПодключитьОбработчикОжидания("ОтправкаПолучениеСообщенийЕСМВ", 300); 
			ОтразитьСтатус(НСтр("ru='Активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
			ОтправкаПолучениеСообщенийЕСМВ();
		Иначе
			ОтразитьСтатус(НСтр("ru='Не активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
		КонецЕсли;	
		СтруктураРезультат = АктуализироватьСведенияОСообщениях(ДатаСтатуса);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРезультат);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьОбмен(Команда)
	ОтключитьОбработчикОжидания("ОтправкаПолучениеСообщенийЕСМВ");
	ОтразитьСтатус(НСтр("ru='Приостановлен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	СтруктураРезультат = АктуализироватьСведенияОСообщениях(ДатаСтатуса);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРезультат);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОтладку(Команда)
	ОтправкаПолучениеСообщенийЕСМВ();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СтруктураРезультат = АктуализироватьСведенияОСообщениях(ДатаСтатуса);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРезультат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтразитьСтатус(СтатусТекст)
	Статус = СтатусТекст;
	ДатаСтатуса = ОбщегоНазначенияКлиент.ДатаСеанса();	
КонецПроцедуры	

&НаКлиенте
Процедура ОтправкаПолучениеСообщенийЕСМВ()
	
	ЗапускДоступен = ПроверитьДоступностьЗапуска(); 
	Если НЕ ЗапускДоступен Тогда
		ОтразитьСтатус(НСтр("ru='Не активен'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка())); 
		Элементы.Статус.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.Статус.Подсказка = НСтр("ru='Обмен не активен т.к. автоматическое взаимодействие с МСД ПУиО ГИИС ЭБ отключено в настройках параметров учета.'", 
		ОбщегоНазначенияКлиент.КодОсновногоЯзыка());	
	КонецЕсли;	
	
	ДатаПоследнегоЗапуска = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	МодульИнтеграции = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцииЕСМВСМЭВКлиент"); 
	МодульЖурналРегистрацииКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЖурналРегистрацииКлиент");

	ИмяСобытия = НСтр("ru='АвтоматическийОбменЕСМВКлиент'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());	
	МассивОрганизаций = ПолучитьМассивОрганизаций();
	
	Для каждого Организация Из МассивОрганизаций Цикл
		Попытка
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СообщатьПользователю", Ложь);
			МодульИнтеграции.ПолучитьОтветыИзОчередиЕСМВ(Организация,,,ДополнительныеПараметры); 
		Исключение
			Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());						
			МодульЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
			"Ошибка", НСтр("ru='Ошибка при получении ответов из очереди ЕСМВ'") + Символы.ПС + Текст);
		КонецПопытки;
		
		Попытка	
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СообщатьПользователю", Ложь);
			МодульИнтеграции.ОбработатьОчередьЗаданий(Организация, ДополнительныеПараметры); 			
		Исключение
			Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());			
			МодульЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
			"Ошибка", НСтр("ru='Ошибка при обработке очереди заданий ЕСМВ'") + Символы.ПС + Текст);
		КонецПопытки;  	
	КонецЦикла;
	
	СтруктураРезультат = АктуализироватьСведенияОСообщениях(ДатаСтатуса);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураРезультат);
			
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПроверитьДоступностьЗапуска()
	Возврат (Константы.АвтоматическаяОтправкаПакетовДанныхМСД.Получить() ИЛИ Константы.АвтоматическийЗапросСроковТаксономииМСД.Получить());	
КонецФункции	
	
&НаСервереБезКонтекста
Функция АктуализироватьСведенияОСообщениях(ДатаСтатуса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ИсторияОбменаЕСМВСМЭВ.ИдентификаторСообщения) КАК ИдентификаторСообщения,
		|	ИсторияОбменаЕСМВСМЭВ.ДействиеПередачи КАК ДействиеПередачи
		|ИЗ
		|	РегистрСведений.ИсторияОбменаЕСМВСМЭВ КАК ИсторияОбменаЕСМВСМЭВ
		|ГДЕ
		|	ИсторияОбменаЕСМВСМЭВ.Период >= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияОбменаЕСМВСМЭВ.ДействиеПередачи";
	
	Запрос.УстановитьПараметр("Период", УниверсальноеВремя(ДатаСтатуса));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураРезультат = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДействиеПередачи = Перечисления.ДействияПередачиЕСМВСМЭВ.Отправка Тогда
			СтруктураРезультат.Вставить("Отправлено", ВыборкаДетальныеЗаписи.ИдентификаторСообщения);
		ИначеЕсли ВыборкаДетальныеЗаписи.ДействиеПередачи = Перечисления.ДействияПередачиЕСМВСМЭВ.Получение Тогда
			СтруктураРезультат.Вставить("Получено", ВыборкаДетальныеЗаписи.ИдентификаторСообщения);
		КонецЕсли;	
	КонецЦикла;
	Возврат СтруктураРезультат;
	
КонецФункции	

&НаСервере
Функция ПолучитьМассивОрганизаций()
	
	МассивОрганизаций = Новый Массив;
	ВыборкаОрганизация = МодульСбораДанных.ПолучитьВыборкуОрганизаций();
	Пока ВыборкаОрганизация.Следующий() Цикл
		МассивОрганизаций.Добавить(ВыборкаОрганизация.Ссылка);	
	КонецЦикла;
	Возврат МассивОрганизаций;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьСведенияОТекущемРабочемМесте(ИмяКомпьютера)
	
	УстановитьПривилегированныйРежим(Истина); 
	МодульПользователи = ОбщегоНазначения.ОбщийМодуль("Пользователи");
	Возврат (Константы.ПользовательКлиентМСД.Получить() = МодульПользователи.ТекущийПользователь() 
	И Константы.ИмяКомпьютераКлиентМСД.Получить() = ИмяКомпьютера);
	
КонецФункции

#КонецОбласти
